/**
 * Пакет для мапперов модуля бронирований.
 * <p>
 * Этот пакет содержит интерфейсы и реализации для преобразования объектов между слоями приложения,
 * такими как DTO (Data Transfer Objects) и сущности модели. Используется библиотека MapStruct для автоматической
 * генерации кода маппинга, что обеспечивает типобезопасность и производительность.
 * </p>
 * <p>
 * Основные компоненты:
 * <ul>
 *     <li>{@link ru.practicum.shareit.booking.mapper.BookingMapper} — маппер для преобразования бронирований
 *     между DTO и моделью.</li>
 * </ul>
 * </p>
 */
package ru.practicum.shareit.booking.mapper;