/**
 * Пакет для репозиториев модуля бронирований.
 * <p>
 * Этот пакет содержит интерфейсы репозиториев, основанные на Spring Data JPA, для выполнения операций с базой данных.
 * Репозитории предоставляют методы для поиска, сохранения и фильтрации бронирований с использованием JPQL-запросов
 * и критериев сортировки.
 * </p>
 * <p>
 * Основные компоненты:
 * <ul>
 *     <li>{@link ru.practicum.shareit.booking.repository.BookingRepository} — репозиторий для работы
 *     с бронированиями.</li>
 * </ul>
 * </p>
 */
package ru.practicum.shareit.booking.repository;